T_tc = [389.197 514.740] + 273.15;
P_tc = [1e8   40e8];
g_tc = [-9639.67670 ,-8552.04287];
% site = { x(Mg)     x(Fe)};
z_tc = [0.87620   0.12380
       0.72151   0.27849];
% ideal       gamma    activity        prop               µ0         RT ln a
ch_tc(:,:,1) =    [
   0.30439   1.1054    0.33646    0.87620  -9989.84079     -5.99862
   6.8317e-9   151.22  1.0331e-6    0.12380  -7043.04640    -75.90314];
ch_tc(:,:,2) =    [
     0.052986   1.5315   0.081146    0.72151  -9346.94922    -16.45246
     1.0077e-5   17.475 0.00017610    0.27849  -6393.39368    -56.62824];
p_tc     = squeeze(ch_tc(:,4,:))';
mu0_tc   = squeeze(ch_tc(:,5,:))';
a_tc     = squeeze(ch_tc(:,3,:))';
a_id_tc  = squeeze(ch_tc(:,1,:))';
gam_tc   = squeeze(ch_tc(:,2,:))';
RTlna_tc = squeeze(ch_tc(:,6,:))';
% a_id_tc.*gam_tc - a_tc

% 8.3144*T_tc(1)*log(a_id_tc.*gam_tc) - RTlna_tc*1e3
