T_tc = [389.197 498.356] + 273.15;
P_tc = [1e8   19.0000e8];
g_tc = [-336.18677,-322.91259];
% site = { x(H2)    x(H2O)};
z_tc = [0.02203   0.97797
        0.00007   0.99993];
% ideal       gamma    activity        prop               µ0         RT ln a
fl_tc(:,:,1) =    [
  0.022028   6.5486    0.14426    0.02203    -51.29496    -10.66252
  0.97797   1.0028    0.98071    0.97797   -342.25643     -0.10726];
fl_tc(:,:,2) =    [
  7.0772e-5   19.304  0.0013662    0.00007    -17.58627    -42.30901
  0.99993   1.0000    0.99993    0.99993   -322.93075     -0.00045];
p_tc     = squeeze(fl_tc(:,4,:))';
mu0_tc   = squeeze(fl_tc(:,5,:))';
a_tc     = squeeze(fl_tc(:,3,:))';
a_id_tc  = squeeze(fl_tc(:,1,:))';
gam_tc   = squeeze(fl_tc(:,2,:))';
RTlna_tc = squeeze(fl_tc(:,6,:))';
% a_id_tc.*gam_tc - a_tc

% 8.3144*T_tc(1)*log(a_id_tc.*gam_tc) - RTlna_tc*1e3
