T_tc = [381.484 601.516] + 273.15;
P_tc = [1e8   40e8];
g_tc = [-2183.61147,-2069.52795];
% site = { x(Mg)     x(Fe)};
z_tc = [0.89171   0.10829
    0.89851   0.10149];
% ideal       gamma    activity        prop               µ0         RT ln a
ol_tc(:,:,1) =    [
    0.79515   1.0174    0.80897    0.89171  -2251.74060     -1.15386
    0.011727   3.2178   0.037735    0.10829  -1595.27157    -17.83721];
ol_tc(:,:,2) =    [
    0.80732   1.0114    0.81652    0.89851  -2131.58860     -1.47410
    0.010300   2.4305   0.025034    0.10149  -1480.21410    -26.81685];
p_tc     = squeeze(ol_tc(:,4,:))';
mu0_tc   = squeeze(ol_tc(:,5,:))';
a_tc     = squeeze(ol_tc(:,3,:))';
a_id_tc  = squeeze(ol_tc(:,1,:))';
gam_tc   = squeeze(ol_tc(:,2,:))';
RTlna_tc = squeeze(ol_tc(:,6,:))';
% a_id_tc.*gam_tc - a_tc

% 8.3144*T_tc(1)*log(a_id_tc.*gam_tc) - RTlna_tc*1e3
